Paran-oid/STM32_Car/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C"
{
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

    /* Private includes ----------------------------------------------------------*/
    /* USER CODE BEGIN Includes */

    /* USER CODE END Includes */

    /* Exported types ------------------------------------------------------------*/
    /* USER CODE BEGIN ET */

    /* USER CODE END ET */

    /* Exported constants --------------------------------------------------------*/
    /* USER CODE BEGIN EC */

    /* USER CODE END EC */

    /* Exported macro ------------------------------------------------------------*/
    /* USER CODE BEGIN EM */

    /* USER CODE END EM */

    void HAL_TIM_MspPostInit(TIM_HandleTypeDef* htim);

    /* Exported functions prototypes ---------------------------------------------*/
    void Error_Handler(void);

    /* USER CODE BEGIN EFP */
    extern void setup();
    extern void loop();
    extern void error_handle(void (*alert)(void));

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin                GPIO_PIN_13
#define B1_GPIO_Port          GPIOC
#define B1_EXTI_IRQn          EXTI15_10_IRQn
#define LD2_Pin               GPIO_PIN_5
#define LD2_GPIO_Port         GPIOA
#define BUZZER_Pin            GPIO_PIN_4
#define BUZZER_GPIO_Port      GPIOC
#define DEBUG_LD_Pin          GPIO_PIN_2
#define DEBUG_LD_GPIO_Port    GPIOB
#define MOTOR1_1_Pin          GPIO_PIN_11
#define MOTOR1_1_GPIO_Port    GPIOB
#define MOTOR1_2_Pin          GPIO_PIN_12
#define MOTOR1_2_GPIO_Port    GPIOB
#define HCSR04_ECHO_Pin       GPIO_PIN_6
#define HCSR04_ECHO_GPIO_Port GPIOC
#define HCSR04_TRIG_Pin       GPIO_PIN_8
#define HCSR04_TRIG_GPIO_Port GPIOC
#define IRControl_Pin         GPIO_PIN_10
#define IRControl_GPIO_Port   GPIOA
#define IRControl_EXTI_IRQn   EXTI15_10_IRQn
#define MOTOR2_1_Pin          GPIO_PIN_11
#define MOTOR2_1_GPIO_Port    GPIOA
#define MOTOR2_2_Pin          GPIO_PIN_12
#define MOTOR2_2_GPIO_Port    GPIOA
#define TMS_Pin               GPIO_PIN_13
#define TMS_GPIO_Port         GPIOA
#define TCK_Pin               GPIO_PIN_14
#define TCK_GPIO_Port         GPIOA
#define SWO_Pin               GPIO_PIN_3
#define SWO_GPIO_Port         GPIOB
#define MOTOR_SPEED_Pin       GPIO_PIN_4
#define MOTOR_SPEED_GPIO_Port GPIOB

    /* USER CODE BEGIN Private defines */

    /* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
